БухЭксп/DataProcessors/CW_ОтправкаПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_ОтправкаПочты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПризнакОтправкиПоЭлектроннойПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПризнакОтправкиПоЭлектроннойПочте</Name>
			<Comment>была ли успешная отправка</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОтправки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОтправкиПоЭлектроннойПочте</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_СтатусыОтправкиПоЭлектроннойПочте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_СтатусыОтправкиПоЭлектроннойПочте</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетОтправки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ЭлектронныеПисьмаДляОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ЭлектронныеПисьмаДляОтправки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучателиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправитьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВидыПолучателейЭлектронныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтображаемоеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Тексты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТекста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кодировка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вложение</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MIME</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьИдентификатор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_События.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_События</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_КонтактыеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеСообщения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/DataProcessors/CW_ОтправкаПочты/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АдресПараметровОповещения",АдресПараметровОповещения);
	
	// если не передали письмо, то 
	Если НЕ Параметры.Свойство("СтруктураПисьма") Тогда
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	СП = Параметры.СтруктураПисьма;
	Если ТипЗнч(СП) <> Тип("Структура") Тогда
		
		// адрес структуры письма
		СП = ПолучитьИзВременногоХранилища(СП);
		
	КонецЕсли; 
	
	_ЗагрузитьПисьмо(СП);
	АдресСтруктурыПисьма = ПоместитьВоВременноеХранилище(СП,УникальныйИдентификатор);
	
	// --- 
	УчетнаяЗапись = СП.Отправитель;
	
	Если Параметры.Свойство("ВидУведомления") Тогда 
		ВидУведомления = Параметры.ВидУведомления;
	КонецЕсли;
	Если Параметры.Свойство("Грузообороты") Тогда 
		Для Каждого Стр Из СП.Грузообороты Цикл
			НовСтрока = Грузообороты.Добавить();
			НовСтрока.Грузооборот = Стр.Ссылка;
		КонецЦикла;	
	КонецЕсли;
	
	// --- 
	
	Если (Параметры.Свойство("Событие")) Тогда
		
		Событие_Контрагент = Параметры.Событие.Контрагент;
		Событие_Объект = Параметры.Событие.ОбъектСобытия;
		
	КонецЕсли; 
	
	ПоказатьСкрытьВложения = ЛОЖЬ;
	УстановитьВидимостьВложений(); 	
	
	УстановитьЗаголовокКнопкиВложения();
	
КонецПроцедуры


&НаСервере
Процедура _УправлениеЭлементамиФормы() 
	// --- 
	
	Элементы.ТекущийТекст.Видимость = (Тексты.Количество() > 1);
	
	// --- 
КонецПроцедуры
 

&НаСервере
Процедура _ЗагрузитьПисьмо(СП)
	// --- 

	Модуль_РаботаСФайлами = CW_РаботаСФайламиСервер.ПолучитьОбщийМодульРаботыСфайлами();
	
	ЭтаФорма.Отправитель = СП.Отправитель;
	// --- 
	ЭтаФорма.Получатели.Очистить();
	Для каждого СА Из СП.Получатели Цикл
		ЭтаФорма.Получатели.Добавить(_ЭП.СтрокаАдресаПоСтруктуре(СА));
	КонецЦикла; 
	
	// --- 
	ЭтаФорма.Получатели_Копии.Очистить();
	Для каждого СА Из СП.Получатели_Копии Цикл
		ЭтаФорма.Получатели_Копии.Добавить(_ЭП.СтрокаАдресаПоСтруктуре(СА));
	КонецЦикла; 
	// --- 
	ЭтаФорма.Получатели_СкрытыеКопии.Очистить();
	Для каждого СА Из СП.Получатели_СкрытыеКопии Цикл
		ЭтаФорма.Получатели_СкрытыеКопии.Добавить(_ЭП.СтрокаАдресаПоСтруктуре(СА));
	КонецЦикла; 
	
	Получатель 				= СтрСоединить(ЭтаФорма.Получатели.ВыгрузитьЗначения(), ";");
	ПолучательКопия 		= СтрСоединить(ЭтаФорма.Получатели_Копии.ВыгрузитьЗначения(), ";");
	ПолучательСкрытаяКопия 	= СтрСоединить(ЭтаФорма.Получатели_СкрытыеКопии.ВыгрузитьЗначения(), ";");
	
	// --- 
	ЭтаФорма.Тема = СП.Тема;
	// --- 
	СчетчикТекстов = 0;
	Для каждого СТ Из СП.Тексты Цикл
		
		Если ТипЗнч(СТ)=Тип("Строка") Тогда
			
			Элементы.ТекущийТекст.СписокВыбора.Добавить(СчетчикТекстов,"Текст №"+Строка(СчетчикТекстов+1));
			Нстр = Тексты.Добавить();
			Нстр.Текст = СТ;
			Нстр.ТипТекста = "";
			Нстр.Кодировка = "UTF-8";
			
			_сф.Инкремент(СчетчикТекстов);
			
		ИначеЕсли ТипЗнч(СТ)=Тип("Структура") Тогда
			
			Элементы.ТекущийТекст.СписокВыбора.Добавить(СчетчикТекстов,"Текст №"+Строка(СчетчикТекстов+1));
			Нстр = Тексты.Добавить();
			Нстр.Текст = СТ.Текст;
			Нстр.ТипТекста = _сф.ст_ПолучитьСвойство(СТ,"ТипТекста");
			Нстр.Кодировка = _сф.ст_ПолучитьСвойство(СТ,"Кодировка");
			
			_сф.Инкремент(СчетчикТекстов);
			
		КонецЕсли;
		
	КонецЦикла; 
	
	// --- 
	ИдентификаторТекущейСтроки = Неопределено;
	Вложения.Очистить();
	Для каждого Вложение Из СП.Вложения Цикл
		
		Нстр = Вложения.Добавить();
		Нстр.ИмяФайла 			= Вложение.ИмяФайла;
		Нстр.ТипАдреса 			= Вложение.ТипАдреса;
		Нстр.Идентификатор 		= Вложение.Идентификатор;
		Нстр.ЕстьИдентификатор 	= ЗначениеЗаполнено(Вложение.Идентификатор);
		Нстр.Адрес				= Вложение.Адрес;
		
		Если ИдентификаторТекущейСтроки = Неопределено и Не Нстр.ЕстьИдентификатор Тогда
			ИдентификаторТекущейСтроки = Нстр.ПолучитьИдентификатор();
		КонецЕсли;
		// --- 
		Если Нстр.ТипАдреса = "адрес" и 
			Не ЗначениеЗаполнено(Вложение.Идентификатор) Тогда //Пропускаем вложения с идентификаторами, это картинки в тексте
			
			ДД = ПолучитьИзВременногоХранилища(Нстр.Адрес);
			Если ТипЗнч(ДД) = Тип("ДвоичныеДанные") Тогда
				Нстр.Размер = _сф.ф_ПриведенныйРазмер(ДД.Размер());
				ДД = Неопределено;
				
				позРаширения = СтрНайти(Вложение.ИмяФайла,".",НаправлениеПоиска.СКонца,,1);
				Расширение = Сред(Вложение.ИмяФайла, позРаширения);
				
				Нстр.ИндексКартинки =  Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(Расширение);
			КонецЕсли;
		
		ИначеЕсли Нстр.ТипАдреса = "ссылка" Тогда 
			
			// необходимо прочитать файл по навигационной ссылке
			// TODO
			
		ИначеЕсли Нстр.ТипАдреса = "путь" Тогда 
			
			Файл = Новый Файл(Нстр.Адрес); 
			Если Файл.Существует() Тогда
				Нстр.Размер = _сф.ф_ПриведенныйРазмер(Файл.Размер());
				Нстр.ИндексКартинки =  Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(Файл.Расширение);
			КонецЕсли;
			Файл = Неопределено;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если ИдентификаторТекущейСтроки <> Неопределено Тогда
		Элементы.Вложения.ТекущаяСтрока = ИдентификаторТекущейСтроки;
	КонецЕсли;
	
	// пока что так
	Если Тексты.Количество() > 0 Тогда
		
		ТекущийТекст = 0;
		СтрокаТексты  = Тексты[ТекущийТекст];
		УстановитьТекстHTML(СтрокаТексты);
	Иначе
		Нстр = Тексты.Добавить();
		Нстр.Текст = "";
		Нстр.ТипТекста = "";
		Нстр.Кодировка = "UTF-8";
	КонецЕсли; 
	
	_УправлениеЭлементамиФормы();
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстHTML(Знач СтрокаТексты)
	
	Если СтрокаТексты.ТипТекста = "HTML" тогда
		Если ЗначениеЗаполнено(СтрокаТексты.Текст) Тогда
			
			СтруктураВложений = Новый Структура;
			Для Каждого СтрокаВложений из Вложения Цикл
				Если СтрокаВложений.ЕстьИдентификатор Тогда
					СтруктураВложений.Вставить(СтрокаВложений.ИмяФайла, СтрокаВложений.Адрес);
				КонецЕсли;
			КонецЦикла;
			
			ТелоHTML.УстановитьHTML(СтрокаТексты.Текст, СтруктураВложений);
			
		КонецЕсли;
	Иначе
		ТелоHTML.Добавить(СтрокаТексты.Текст);
	КонецЕсли;

КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Отправить(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Тексты.Количество() = 1 Тогда
		ОбработатьТекстПисьма(0);
	КонецЕсли;
	
	ВыполнитьОтправку();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьТекстПисьма(ИндексСтроки)
	
	Модуль_РаботаСФайлами = CW_РаботаСФайламиКлиент.ПолучитьОбщийМодульРаботыСфайлами();
	
	ТекстHTML = "";
	СтруктураВложений = Новый Структура;
	ТелоHTML.ПолучитьHTML(ТекстHTML, СтруктураВложений);
	
	Тексты[ИндексСтроки].Текст 		= ТекстHTML;
	
	Если ПустаяСтрока(Тексты[ИндексСтроки].ТипТекста) Тогда
		Тексты[ИндексСтроки].ТипТекста 	= ?(СтрНайти(ТекстHTML, "html") > 0,"html", "");
	КонецЕсли;
	
	СтруктураОтбора = Новый Структура("ЕстьИдентификатор", Истина);
	мСтроки = Вложения.НайтиСтроки(СтруктураОтбора);
	Для Каждого СтрокаВложения из мСтроки Цикл
		Вложения.Удалить(СтрокаВложения);
	КонецЦикла;
	
	Для Каждого ЭлементСтруктуры из СтруктураВложений Цикл
		Нстр = Вложения.Добавить();
		Нстр.ИмяФайла 			= ЭлементСтруктуры.Ключ;
		Нстр.ТипАдреса 			= "Картинка";
		Нстр.Адрес 				= ЭлементСтруктуры.Значение;
		Нстр.Идентификатор 		= ЭлементСтруктуры.Ключ;
		Нстр.ЕстьИдентификатор 	= Истина;
		
		позРаширения = СтрНайти(ЭлементСтруктуры.Ключ,".",НаправлениеПоиска.СКонца,,1);
		Расширение = Сред(ЭлементСтруктуры.Ключ, позРаширения);
		
		Нстр.ИндексКартинки =  Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(Расширение);

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОтправку() 
	// --- 
	
	СтатусОтправки = _ОтправитьПисьмо();
	Если СтатусОтправки.Код = 1  Тогда
		
		// показываем предупреждение
		Сообщить(СтатусОтправки.ОписаниеОшибки);
		
		// спрашиваем
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаПовтораОтправки",ЭтотОбъект, Новый Структура("СтатусОтправки",СтатусОтправки)); 
		ПоказатьВопрос(ПОВ,"Ошибка отправки. Повторить попытку?", РежимДиалогаВопрос.ДаНетОтмена);
		
		
	ИначеЕсли СтатусОтправки.Код <> 1  Тогда

		_ПослеУспешнойОтправкиПисьма(СтатусОтправки.Код);
		
		Если СтатусОтправки.Код = 0 Тогда
			ТекстОповещения = "Письмо """+Тема+""" успешно отправлено!";
			
			ПоказатьОповещениеПользователя("Отправка письма",,ТекстОповещения);			
		ИначеЕсли СтатусОтправки.Код = 2 Тогда
			Оповещение = Новый ОписаниеОповещения("ОбработатьНажаниеНаОповещение", ЭтотОбъект);
			
			ТекстОповещения = "Письмо """+Тема+""" в очереди на оптравку!";
			ПоказатьОповещениеПользователя("Отправка письма",Оповещение,ТекстОповещения);			
		КонецЕсли;
		
		
		Оповестить("CW_ЭлектронноеПисьмоОтправлено",АдресПараметровОповещения);
			
		ЭтаФорма.Закрыть(СтатусОтправки);
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажаниеНаОповещение(ДополнительныеПараметры) Экспорт
	
	ОткрытьФорму("Справочник.CW_ЭлектронныеПисьмаДляОтправки.ФормаСписка");
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаВопросаПовтораОтправки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ=КодВозвратаДиалога.Да Тогда
		
		ВыполнитьОтправку();
		
	ИначеЕсли Ответ=КодВозвратаДиалога.Нет Тогда 
		
		ЭтаФорма.Закрыть(ДополнительныеПараметры.СтатусОтправки);
		
	Иначе
		
		флПродолжения=Ложь;
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Процедура ПрописатьВРегистр(ВидУведомления, ГрузооборотыТЗ)
	
	ГрузооборотыТЗ = ПолучитьИзВременногоХранилища(ГрузооборотыТЗ);
	Если НЕ ВидУведомления = Неопределено Тогда  
		Регистр = РегистрыСведений.СтатусыУведомлений.СоздатьНаборЗаписей();
		Для Каждого Стр Из Грузообороты Цикл
			Запись = Регистр.Добавить();
			Запись.Период = ТекущаяДата();
			Запись.Грузооборот = Стр.Грузооборот;
			Запись.ВидРассылки = ВидУведомления;
			Запись.Дата = ТекущаяДата();
			Запись.Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь().Имя);
		КонецЦикла;	
		Регистр.Записать(Ложь);
	КонецЕсли;	
		
КонецПроцедуры	

&НаСервере
Функция _ОтправитьПисьмо()
	
	// перезаполняем структуру письма
	СтруктураПисьма = ПолучитьИзВременногоХранилища(АдресСтруктурыПисьма);
	
	// перезаполняем структуру письма
	
	СтруктураПисьма.Отправитель = Отправитель;
	// --- 

	//Получатели
	СтруктураПисьма.Получатели.Очистить();
	мПолучатель = СтрРазделить(Получатель,";", Ложь);
	Для каждого СтрокаАдреса Из мПолучатель Цикл
		СтруктураПисьма.Получатели.Добавить(_ЭП.СтруктураАдресаПоСтроке(СтрокаАдреса));
	КонецЦикла;
	//Получатели
	
	//Получатели копия
	СтруктураПисьма.Получатели_Копии.Очистить();
	мПолучательКопия = СтрРазделить(ПолучательКопия,";", Ложь);
	Для каждого СтрокаАдреса Из мПолучательКопия Цикл
		СтруктураПисьма.Получатели_Копии.Добавить(_ЭП.СтруктураАдресаПоСтроке(СтрокаАдреса));
	КонецЦикла;
	//Получатели копия
	
	//Получатели скрытая копия
	СтруктураПисьма.Получатели_СкрытыеКопии.Очистить();
	мПолучательСкрытаяКопия = СтрРазделить(ПолучательСкрытаяКопия,";", Ложь);
	Для каждого СтрокаАдреса Из мПолучательСкрытаяКопия Цикл
		СтруктураПисьма.Получатели_СкрытыеКопии.Добавить(_ЭП.СтруктураАдресаПоСтроке(СтрокаАдреса));
	КонецЦикла;
	//Получатели скрытая копия
	
	//Обратные адреса
	СтруктураПисьма.ОбратныеАдреса.Очистить();
	мАдресОтвета = СтрРазделить(АдресОтвета,";", Ложь);
	Для каждого СтрокаАдреса Из мАдресОтвета Цикл
		СтруктураПисьма.ОбратныеАдреса.Добавить(_ЭП.СтруктураАдресаПоСтроке(СтрокаАдреса));
	КонецЦикла;
	//Обратные адреса
	
	Если Важное Тогда
		СтруктураПисьма.Важность = ВажностьИнтернетПочтовогоСообщения.Высокая;
	КонецЕсли;
	
	// --- 
	СтруктураПисьма.Тема = Тема;
	// --- 
	СтруктураПисьма.Вложения.Очистить();
	
	ИспользуетсяОчередь = ПолучитьФункциональнуюОпцию("CW_ИспользованиеОчередиНаОтправку");
	Если Не ИспользуетсяОчередь Тогда
		//Выполяем замену картинок на локальные ссылки, только в случае прямой отправки
		СоответствиеЛокальныхФайлов = новый Соответствие;
		Отбор = Новый Структура("ЕстьИдентификатор", истина);
		мСтроки = Вложения.НайтиСтроки(Отбор);
		Для Каждого СтрокаВложений из мСтроки Цикл
			Картинка = СтрокаВложений.Адрес;
			ДвоичныеДанные = Картинка.получитьДвоичныеДанные();
			ИмяВременогофайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные.Записать(ИмяВременогофайла);
			СоответствиеЛокальныхФайлов.Вставить(СтрокаВложений.Идентификатор, ИмяВременогофайла);
			
			Вложения.Удалить(СтрокаВложений);
		КонецЦикла;
	КонецЕсли;
	
	Для каждого Стр Из Вложения Цикл
		_ЭП.ДобавитьВложение(СтруктураПисьма,Стр.ИмяФайла,Стр.ТипАдреса,Стр.Адрес, стр.Идентификатор);
	КонецЦикла; 

	// --- 
	СтруктураПисьма.Тексты.Очистить();
	Для каждого СТ Из Тексты Цикл
		
		Текст = СТ.Текст;
		Если Не ИспользуетсяОчередь Тогда
			Если СТ.ТипТекста = "HTML" Тогда
				Для Каждого ЭлементСоответствия из СоответствиеЛокальныхФайлов Цикл
					Текст = СтрЗаменить(Текст,ЭлементСоответствия.Ключ, ЭлементСоответствия.Значение);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		_ЭП.ДобавитьТекст(СтруктураПисьма,Текст,СТ.ТипТекста,СТ.Кодировка);
	КонецЦикла; 
	
	Если ТипЗнч(Событие_Объект) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
		Если ЗначениеЗаполнено(Событие_Объект) Тогда
			СтруктураПисьма.Вставить("СсылкаНаОбъект", Событие_Объект);
		КонецЕсли;
	КонецЕсли;
	
	Возврат(_ЭП.ОтправитьПисьмо(СтруктураПисьма));
	
	// --- 
КонецФункции

&НаСервере
Процедура _ПослеУспешнойОтправкиПисьма(КодОтвета)
	
	// зафиксируем факт отправки - если отправлено письмо из документа Доходы
	_ПроставитьПризнакОтправкиПоЭлектроннойПочте(КодОтвета);

	// если включена опция, то отправленные письма можно сохранять в Событиях
	_СформироватьСобытиеПоОтправкеПисьма();

КонецПроцедуры

&НаСервере
Процедура _ПроставитьПризнакОтправкиПоЭлектроннойПочте(КодОтвета)
	
	Если НЕ ЗначениеЗаполнено(Событие_Объект) Тогда 
		// фиксировать нечего
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Событие_Объект)<>Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда 
		// кроме Доходов пока ничего не фиксируем
		Возврат;
	КонецЕсли;
	
	СоответствиеСтатусаОтправки =ПолучитьСоответствиеКодаСтатусаОтправки();
	
	ЗаписьРегистра = РегистрыСведений.CW_ПризнакОтправкиПоЭлектроннойПочте.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Документ 		= Событие_Объект;
	ЗаписьРегистра.ДатаОтправки 	= ТекущаяДата();
	ЗаписьРегистра.СтатусОтправки 	= СоответствиеСтатусаОтправки.Получить(КодОтвета);
	
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеКодаСтатусаОтправки()
	
	Результат = новый Соответствие;
	Результат.Вставить(0, ПредопределенноеЗначение("Перечисление.CW_СтатусыОтправкиПоЭлектроннойПочте.Отправлено"));
	Результат.Вставить(2, ПредопределенноеЗначение("Перечисление.CW_СтатусыОтправкиПоЭлектроннойПочте.ОжидаетОтправки"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура _СформироватьСобытиеПоОтправкеПисьма()
	
	Если НЕ ЗначениеЗаполнено(Событие_Контрагент) Тогда 
		Возврат;
	КонецЕсли;
	
	РегистрироватьСобытия = Константы.CW_РегистрироватьСобытияОтправкиПисемКлиентам.Получить();
	Если Не РегистрироватьСобытия Тогда 
		Возврат;
	КонецЕсли; 
	
	ТипСобытия 				= Константы.CW_РегистрироватьСобытияОтправкиПисемКлиентам_ТипСобытия.Получить();
	ФорматированнаяСтрока 	= ТелоHTML.ПолучитьФорматированнуюСтроку();
	
	МассивСтрок = Новый Массив;    
	МассивСтрок.Добавить("Получатели: "+_сф.сп_Представление(Получатели,";",Ложь)); 
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить("Копии: "+_сф.сп_Представление(Получатели_Копии,";",Ложь));
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить("Тема:"+Тема);
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(Символы.ПС);
	МассивСтрок.Добавить(ФорматированнаяСтрока);
	
	НоваяФорматированнаяСтрока = новый ФорматированнаяСтрока(МассивСтрок);
	
	ФорматированныйДокумент = Новый ФорматированныйДокумент;
	ФорматированныйДокумент.УстановитьФорматированнуюСтроку(НоваяФорматированнаяСтрока);
	
	СтруктураСобытия = Справочники.CW_События.ПоучитьСтруктуруСобытия();
	СтруктураСобытия.ТипСобытия 	= ТипСобытия;
	СтруктураСобытия.Владелец 		= Событие_Контрагент;
	СтруктураСобытия.ОбъектСобытия 	= Событие_Объект;
	СтруктураСобытия.Сообщение 		= ФорматированныйДокумент;
	
	Справочники.CW_События.СоздатьСобытие(СтруктураСобытия, Истина);

КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Печать(Команда)
	
	ПараметрыФормы = Новый Структура("АдресТабличногоДокумента",_ПолучитьАдресПечатнойФормыПисьмы());	
	ОткрытьФорму("Обработка.CW_ОтправкаПочты.Форма.ФормаПредпросмотраПисьма",ПараметрыФормы);
	
КонецПроцедуры

&НаСервере
Функция _ПолучитьАдресПечатнойФормыПисьмы()
	// --- 
	
	// --- 
	ТД = Новый ТабличныйДокумент;
	ТД.АвтоМасштаб=Истина;
	ТД.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	
	// --- 
	Макет = Обработки.CW_ОтправкаПочты.ПолучитьМакет("МакетПисьма");
    Макет.Параметры.Отправитель = Отправитель;
	Макет.Параметры.Получатели = _сф.сп_Представление(Получатели,,ЛОЖЬ);
	Макет.Параметры.Дата = Формат(ТекущаяДата(),"ДЛФ=DD");
	Макет.Параметры.Тема = Тема;
	Макет.Параметры.Тело = ТелоHTML.ПолучитьТекст();
	
	ТД.Вывести(Макет);
	
	Возврат(ПоместитьВоВременноеХранилище(ТД,УникальныйИдентификатор));
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ВложенияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	// необходимо загрузить файл
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаВыбораФайлов",ЭтотОбъект, Новый Структура()); 
	ДиалогОткрытияФайла.Показать(ПОВ);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораФайлов(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		
		МассивПередаваемыхФайлов = Новый Массив;
		Для каждого ЭлементМассива Из Ответ Цикл
			
			МассивПередаваемыхФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ЭлементМассива));
			
		КонецЦикла; 
		// --- 
		Если (МассивПередаваемыхФайлов.Количество() <> 0) Тогда
			
			ПОВ = Новый ОписаниеОповещения("ОбработатьПомещениеФайлов",ЭтотОбъект, Новый Структура()); 
			НачатьПомещениеФайлов(ПОВ,МассивПередаваемыхФайлов,,Ложь,ЭтаФорма.УникальныйИдентификатор);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПомещениеФайлов(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (ПомещенныеФайлы <> Неопределено) Тогда
		
		Модуль_РаботаСФайлами = CW_РаботаСФайламиКлиент.ПолучитьОбщийМодульРаботыСфайлами();
	
		Для каждого ПомещенныйФайл Из ПомещенныеФайлы Цикл
			
			ФайлОбъект = Новый Файл(ПомещенныйФайл.ПолноеИмя);
			// --- 
			Нстр = Вложения.Добавить();
			Нстр.ИмяФайла 		= ФайлОбъект.Имя;
			Нстр.ТипАдреса 		= "адрес";
			Нстр.Адрес 			= ПомещенныйФайл.Хранение;
			Нстр.Размер 		= ПриведенныйРазмер(ФайлОбъект.Размер());
			Нстр.ИндексКартинки = Модуль_РаботаСФайлами.ПолучитьИндексПиктограммыФайла(ФайлОбъект.Расширение);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	УстановитьЗаголовокКнопкиВложения();
	
КонецПроцедуры
  

&НаСервереБезКонтекста
Функция ПриведенныйРазмер(Размер)
	
	Возврат(_сф.ф_ПриведенныйРазмер(Размер));
	
КонецФункции

&НаКлиенте
Процедура ВложенияПередУдалением(Элемент, Отказ)
	
	// удаляем из временного хранилища
	_ОбработатьУдаляемоеВложение(Элементы.Вложения.ТекущаяСтрока);	 
	
КонецПроцедуры

&НаСервере
Процедура _ОбработатьУдаляемоеВложение(ИДстроки)
	// --- 
	
	СтрокаВложения = Вложения.НайтиПоИдентификатору(ИДстроки);
	Если СтрокаВложения <> Неопределено Тогда
		
		Попытка
			
			УдалитьИзВременногоХранилища(СтрокаВложения.АдресФайла);
			
		Исключение
		    //ОписаниеОшибки()
		КонецПопытки; 
		
	КонецЕсли; 
	
	
	// --- 
КонецПроцедуры

// --- 

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	СтрокаВложения = Вложения.НайтиПоИдентификатору(Элементы.Вложения.ТекущаяСтрока);
	ТипАдреса = _ОпределитьТипАдресаВложения(Элементы.Вложения.ТекущаяСтрока);
	
	Если ТипАдреса = "адрес"  или ТипАдреса = "путь"  Тогда  
		
		АдресВоВременномХранилище = СтрокаВложения.Адрес;
		
		//Заявка №AFR-240138 от 28.03.2024
		Если ТипАдреса = "путь" Тогда
			АдресВоВременномХранилище = ПолучитьАдресВоВременномХранилище(СтрокаВложения.Адрес);
		КонецЕсли;
		//Заявка №AFR-240138 от 28.03.2024
		
		ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
		
		НачатьПолучениеФайлаССервера(АдресВоВременномХранилище, СтрокаВложения.ИмяФайла, ПараметрыДиалогаПолученияФайлов);
		
	Иначе
		ПоказатьПредупреждение(,"Сохранение файла не доступно!");
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьАдресВоВременномХранилище(ПолноеИмяФайла) 
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);  
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Функция _ОпределитьТипАдресаВложения(Строка)
	// --- 
	
	СтрокаВложения = Вложения.НайтиПоИдентификатору(Строка);
	Возврат(СтрокаВложения.ТипАдреса);
	
	// --- 
КонецФункции
 

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ТекущийТекстПриИзменении(Элемент)
	
	// загружаем выбранный текст
	УстановитьТекстHTML(Тексты[ТекущийТекст]);
	
КонецПроцедуры

&НаКлиенте
Процедура ТелоПриИзменении(Элемент)
	
	Если Тексты.Количество() > 1 Тогда
		ОбработатьТекстПисьма(ТекущийТекст);
	КонецЕсли;
	
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура Техподдержка(Команда)
	
	СА = Новый Структура("Адрес,ОтображаемоеИмя","buhexp@coralway.ru","Coral Way");
	Получатели.Добавить(_ЭП.СтрокаАдресаПоСтруктуре(СА));
	// --- 
	Тема = "AF8"+_ИдентификаторОрганизации() + Формат(ТекущаяДата(),"ДФ=dd.MM.yyyy");
	
КонецПроцедуры

&НаСервере
Функция _ИдентификаторОрганизации()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Ключ_Организация 			= CW_ПроверкаЛицензии.ПолучитьНазваниеОрганизации();
	Ключ_РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	Возврат " "+СокрЛП(Ключ_Организация)+"/"+СокрЛП(Ключ_РегистрационныйНомер)+" ";
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ПолучательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораАдреса("Получатель");
КонецПроцедуры

&НаКлиенте
Процедура АдресОтветаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораАдреса("АдресОтвета");
КонецПроцедуры

&НаКлиенте
Процедура ПолучательКопияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораАдреса("ПолучательКопия");
КонецПроцедуры

&НаКлиенте
Процедура ПолучательСкрытаяКопияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбораАдреса("ПолучательСкрытаяКопия");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораАдреса(Знач ИмяРеквизита)
	
	АдресСписка = ПолучитьСписокАдерсовНаСервере(ИмяРеквизита);
	
	ПараметрыФормыПодбора = Новый Структура;
	ПараметрыФормыПодбора.Вставить("АдресСписка", 		АдресСписка);
	ПараметрыФормыПодбора.Вставить("ОтборКонтрагент", 	Событие_Контрагент);
	
	ОпианиеОпвещения = Новый ОписаниеОповещения("ДобавитьАдреса", ЭтотОбъект, ИмяРеквизита); 
	
	ОткрытьФорму("Обработка.CW_ОтправкаПочты.Форма.ФормаДобавленияАдресатов",ПараметрыФормыПодбора,ЭтаФорма,,,,ОпианиеОпвещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокАдерсовНаСервере(ИмяРеквизита)
	
	мДанныеРеквизита 	= СтрРазделить(ЭтаФорма[ИмяРеквизита],";",Ложь);
	
	Возврат ПоместитьВоВременноеХранилище(мДанныеРеквизита, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ДобавитьАдреса(РезультатВыбора, ИмяРеквизита) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьАдресПолучателя(ИмяРеквизита, РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьАдресПолучателя(ИмяРеквизита,РезультатВыбора)
	
	Если ЭтоАдресВременногоХранилища(РезультатВыбора) Тогда
		ТекстАдресов = ПолучитьИзВременногоХранилища(РезультатВыбора);
		ЭтаФорма[ИмяРеквизита] = ТекстАдресов;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Вложения(Команда)
	
	ПоказатьСкрытьВложения = Не ПоказатьСкрытьВложения;
	
	УстановитьВидимостьВложений();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьВложений()
	
	Элементы.СтраницаВложения.Видимость = ПоказатьСкрытьВложения;
	Элементы.ФормаВложения.Пометка 		= ПоказатьСкрытьВложения;

КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокКнопкиВложения()
	
	Элементы.ФормаВложения.Заголовок = "Вложения"+?(Вложения.Количество()=0,"", " ("+Формат(Вложения.Количество(),"ЧГ=0")+")");

КонецПроцедуры

&НаКлиенте
Процедура ВложенияПослеУдаления(Элемент)
	
	УстановитьЗаголовокКнопкиВложения();

КонецПроцедуры
